{
	"db" : [
		{
			"id" : "00001",
			"title" : "Bagnet",
			"description" : "Bagnet is a Filipino dish referring to twice-cooked pork belly. This is a well-known specialty in Vigan, Ilocos which is often confused with lechon kawali. The difference is mainly on the cooking method. Lechon kawali is deep-fried only once, but bagnet is fried twice with much longer frying time.",
			"image" : "https://3.bp.blogspot.com/-_EGizVJ4vFY/Unh5cTyXqlI/AAAAAAAACsU/5j6eacRCPco/s1600/bagnet+perfect+(2).JPG",
			"ingredients" : [
				"2 to 2 1/2 lbs. whole pork belly",
				"1 medium red onion",
				"1 tablespoon whole black peppercorn",
				"1 1/2 tablespoons salt",
				"6 cloves crushed garlic",
				"4 to 6 cups water",
				"3 cups cooking oil"
			],
			"instructions" : [
				"Arrange the pork belly in a wide and deep cooking pot. Pour-in the water. Make sure that the pork belly is fully submerged in water. Let boil.",
				"Once the water starts to boil, add the garlic, onion, 1 tablespoon salt, and whole black peppercorn. Simmer for 30 to 40 minutes.",
				"Remove the boiled pork belly from the cooking pot and place in a plate. Let it cool to room temperature.",
				"Rub the remaining 1/2 tablespoon of salt all over the boiled pork belly. Let is stay for 10 to 20 minutes.",
				"Heat the cooking oil in a deep cooking pot. When the oil gets hot, gently put-in the pork belly and deep-fry in medium heat until the pork belly turns golden brown and the texture gets crispy. The oil will splatter during this process, so be careful. Make sure that you do not cover the cooking pot completely while deep frying. You can put a splatter guard on top of the cooking pot to control the oil.",
				"Once the pork belly is golden brown and crispy, remove it from the cooking pot and arrange in a plate lined with paper towel. Turn the stove off and let the pork belly cool down to room temperature.",
				"When the pork belly cools down, heat-up the oil on more time. Deep fry the same pork belly for the second time in medium heat for 5 to 10 minutes or until it gets extra crispy.",
				"Remove from the cooking pot and place in a plate lined with paper towel. Let the towel absorb the excess oil.",
				"Slice the pork bagnet into serving pieces and serve with bagoong monamon (also known as bugguong munamon) or even guinamos or bagoong Balayan. Note: you can squeeze lemon or calamansi on the bagoong to make it taste better.",
				"Share and enjoy!"
			],
			"video_link" : ""
		},
		{
			"id" : "00002",
			"title" : "Pinakbet",
			"description" : "Pakbet or pinakbet is a popular vegetable dish that originated from one of the northern provinces of the Philippines, Ilocos. The vegetables used on this dish are usually grown in the back yard of every villager and are available almost all year long. Bitter Melon, eggplant, okra, and string beans are just some of the vegetables that make-up this delightful dish.",
			"image" : "https://flyingketchup.ph/wp-content/uploads/2022/03/maxresdefault.jpg",
			"ingredients" : [
				"1 lb lechon kawali sliced",
				"1 piece Knorr Shrimp Cube",
				"12 pieces sitaw cut into 2 inch length",
				"1/2 piece kalabasa cubed",
				"12 pieces okra",
				"1 piece Chinese eggplant sliced",
				"1 piece ampalaya sliced",
				"1 piece kamote cubed (optional)",
				"2 pieces tomato cubed",
				"2 thumbs ginger crushed (optional)",
				"1 piece onion chopped",
				"4 cloves garlic crushed",
				"2 teaspoons bagoong alamang",
				"2 1/2 cups water",
				"3 tablespoons cooking oil",
				"1/4 teaspoon ground black pepper"
			],
			"instructions" : [
				"Heat cooking oil in a pot. Saute onion and garlic. Add ginger and continue to cook until the onion softens.",
				"Add lechon kawali. Saute for 1 minute.",
				"Pour water. Let boil.",
				"Add Knorr Shrimp Cube. Cover the pot and cook in medium heat for 20 minutes.",
				"Add tomato and bagoong alamang. Stir. Cover the pot. Cook for 3 minutes.",
				"Put the kalabasa and kamote into the pot. Cook for 7 minutes.",
				"Add sitaw, okra, ampalaya, and eggplant. Stir. Cover the pot and cook for 5 minutes.",
				"Season with ground black pepper and add remaining lechon kawali. Cook for minutes.",
				"Tranfer to a serving plate. Serve. Share and Enjoy!"
			],
			"video_link" : ""
		},
		{
			"id" : "00003",
			"title" : "Vigan Empanada",
			"description" : "Vigan Empanada is a popular snack sold in stalls and restaurants. Think of it as a half moon-shaped, taco-like snack. It’s typically made of eggs, grated green papaya, and skinless Vigan Longganisa, wrapped in a thin rice flour batter, and deep fried to a crisp. Each stall has their own variety (such as with meat or vegetarian) and portioning (double the meat or double all ingredients).",
			"image" : "https://www.eagerexplorer.com/wp-content/uploads/2014/02/p1070953-e1434459175786.jpg",
			"ingredients" : [
				"1 1/2 cup Mochiko Rice Flour",
				"1/2 cup Water",
				"1 tbsp. Oil",
				"1 Green UN-Ripe Papaya grated",
				"4 pcs. Longganisa Sausage Chopped (remove from its casing)",
				"1/2 Chopped Onion",
				"1 Garlic Clove Finely Chopped",
				"6 Eggs",
				"Salt",
				"Pepper",
				"Cooking Oil for deep frying"
			],
			"instructions" : [
				"Mix ingredients in a bowl and knead dough lightly.",
				"Take about a 2-3 tablespoons of dough and flatten with rolling pin.",
				"Set aside while you make your filling. Before you make your filling preheat your deep fryer by adding the cooking oil and set aside.",
				"In another skillet pan saute garlic and onions in oil. Add Longganisa Sausage and season with salt and pepper to desired. When sausage is cooked pu t in a bowl and mix it a little to cool it down. Wait 2-3 minutes and mix in grated papaya.",
				"Spoon out 2-3 tablespoons of filling to flattened dough and crack a piece of fresh egg. Seal the sides and deep fry in the preheated deep fryer.",
				"Place Empanadas in a plate topped with plenty of paper towels to blot oil. Serve in another clean platter and with sweet chili dip or garlic vinegar on the side."
			],
			"video_link" : ""
		},
		{
			"id" : "00004",
			"title" : "Ilocos-style Miki Noodle Soup",
			"description" : "This Filipino noodle soup is made with miki noodles, chicken stock, and annato powder (atsuete). The Ilocos-style miki noodle soup is usually served with boiled egg and is topped with ground bagnet (which they refer to as “chicharon”).",
			"image" : "https://images.yummy.ph/yummy/uploads/2016/08/Ilokano-styleMiki640-1.jpg",
			"ingredients" : [
				"2 tablespoons cooking oil",
				"4 cloves Garlic crushed",
				"1/4 kilo Chicken (use breast part, cooked), shredded",
				"8 cups chicken stock (or 2 chicken cubes to be dissolved in 8 cups of water)",
				"1/4 Cup Achuete Powder (annatto powder)",
				"1 kilo flat rice noodles (you can use any pre-made noodles from the market to save time)",
				"Salt to taste",
				"Bagnet for topping",
				"1 Egg boiled"
			],
			"instructions" : [
				"Sauté crushed garlic in preheated oil and add shredded chicken.",
				"Add chicken stock. Bring to a boil.",
				"Add annato powder and simmer until it boils. (If using annatto seeds, boil in hot water and strain the liquid over the broth.)",
				"Add the noodles and cook for 3 to 5 minutes.",
				"Ladle some soup and noodles in a bowl then top with bagnet and a whole egg."
			],
			"video_link" : ""
		},
		{
			"id" : "00005",
			"title" : "Dinengdeng",
			"description" : "Dinengdeng is a flavorful vegetable dish often mistaken for Pinakbet due to its similar cooking method and appearance. This vibrant dish is made with okra, eggplant, and bitter melon, cooked with bagoong, and served with rice.\n\nDinengdeng is different from Pinakbet because it typically uses green or yellow vegetables like malunggay leaves and fruits, squash, and squash blossoms. At the same time, Pinakbet contains the more colorful “Bahay Kubo” veggies. Grilled pieces of fish or other meat can also be added to the mix for an extra flavor.",
			"image" : "https://i.ytimg.com/vi/-xd3CIYC3eQ/maxresdefault.jpg",
			"ingredients" : [
				"1 whole milk fish sliced and grilled",
				"2 to 3 cups malunggay moringa leaves, cleaned",
				"2 cups squash flower",
				"12 to 15 pieces small to medium sized okra",
				"1 bundle string beans sliced into 3 inch pieces",
				"2 pieces medium ampalaya bitter gourd, cored and sliced",
				"2 to 3 tablespoons bagoong isda unprocessed fish sauce",
				"1 knob ginger sliced",
				"2 medium tomato chopped",
				"1 medium onion chopped",
				"3 cups water"
			],
			"instructions" : [
				"Bring water to a boil in a large cooking pot.",
				"Add the ginger, onion, and tomato. Cook covered for 5 minutes.",
				"Pour-in the bagoong isda. Stir.",
				"Add okra and string beans. Stir and add the ampalaya. Cook in medium heat for 7 to 10 minutes.",
				"Put-in the squash flower and malunggay leaves. Cook for 3 to 5 minutes.",
				"Add the grilled milk fish. Let it stay for 3 to 5 minutes to add flavor to the dish.",
				"Serve. Share and enjoy!"
			],
			"video_link" : ""
		},
		{
			"id" : "00006",
			"title" : "Igado",
			"description" : "The succulent pork tenderloin and innards of Igado come together to create a unique and tasty dish. The sweet-and-sour notes of the pork, combined with the tangy flavor of Sukang Iloko, soy sauce, and pepper, make this dish a delight for the taste buds.",
			"image" : "https://images.summitmedia-digital.com/yummyph/images/november_2015/igado-645.jpg",
			"ingredients" : [
				"1/2 lbs. pork tenderloin sliced into 2-inch strips",
				"1/2 lb. pork liver sliced into 2-inch strips",
				"1/2 lb. pork kidney",
				"1 Knorr Pork Cube",
				"1 red bell pepper cut into strips",
				"1/2 cup green peas",
				"1 carrot julienne",
				"3 laurel leaves",
				"1 onion minced",
				"5 cloves garlic minced",
				"6 tablespoons soy sauce",
				"5 tablespoons white vinegar",
				"1 1/4 cup water",
				"4 tablespoons cooking oil",
				"Salt and pepper to taste"
			],
			"instructions" : [
				"Boil the kidney with 4 thumbs of ginger for at least 30 minutes. Let it cool down and slice into 2-inch strips. Set aside.",
				"Heat 2 tablespoons of cooking oil in a pan. Sauté the pork liver for 2 minutes. Remove from the pan and set aside.",
				"Pour the remaining oil in the pan. Once hot, sauté garlic and onion until the latter softens.",
				"Add the pork kidney. Cook for 1 minute.",
				"Add the pork tenderloin. Sauté until the outer layer turns light brown.",
				"Pour the soy sauce and vinegar into the pan. Let the liquid boil. Stir.",
				"Add the laurel leaves and pour water. Let boil. Reduce the heat between low to medium setting. Continue cooking for 40 minutes.",
				"Add Knorr Pork Cube. Cook for 8 minutes.",
				"Add the liver back into the pan. Stir and continue cooking for 3 minutes.",
				"Put the bell pepper, carrot, and green peas.",
				"Season with salt and ground black pepper. Cook for 2 minutes.Transfer to a serving bowl. Serve hot with rice.",
				"Share and enjoy!"
			],
			"video_link" : ""
		},
		{
			"id" : "00007",
			"title" : "Sinanglaw",
			"description" : "Sinanglaw is a Filipino soup dish prepared with beef and beef offal flavoured with kamias and bile, nearly similar to pinapaitan.",
			"image" : "https://www.angsarap.net/wp-content/uploads/2017/10/Sinanglaw-Wide.jpg",
			"ingredients" : [
				"500 g beef brisket or any cheap cut, cubed",
				"300 g beef tendons, cut into squares",
				"300 g pre-cooked beef tripe, cubed",
				"1/4 cup diluted beef bile or 2-3 pcs bitter gourd, roughly chopped",
				"500 g kamias or tamarind",
				"1 whole garlic, minced",
				"1 thumb size ginger, thinly sliced",
				"2 large onion, quartered",
				"6 pcs finger chillies, thinly sliced",
				"fish sauce or sea salt",
				"spinach leaves, optional",
				"oil"
			],
			"instructions" : [
				"In a deep pot, put oil then sauté garlic, onions and ginger.",
				"Add beef and brown all sides. Once brown, add the beef tendons.",
				"Add water to the pot enough to cover the meat pieces. Bring it to a boil then simmer soup for 45 minutes in low heat.",
				"Turn off the heat then drain the soup using a fine sieve to have a clear broth. Set aside the meat pieces. Place clear broth on another pot together with the tendons and set aside the beef. Bring it to a boil and simmer until tendons are soft (this might take 90 to 120 minutes more) add water if needed.",
				"Add the beef, tripe, finger chillies and bile (if using). At this stage if you are using bitter gourd place it in a muslin cloth together with tamarind or kamias, wrap it well then place into the pot. Simmer for 30 minutes.",
				"Press the muslin cloth over the soup to extract the juices then season with salt or fish sauce. If you want to add some leafy greens, I suggest spinach. Serve hot."
			],
			"video_link" : ""
		},
		{
			"id" : "00008",
			"title" : "Tupig",
			"description" : "Tupig, also known as intemtem, is a rice delicacy or kakanin that originated in the northwestern part of the Philippines, particularly the province of Pangasinan and the Ilocos region. These places are also where this sweet rice delicacy is the most popular and became their specialty kakanin. This is very evident whenever I’ve traveled to that part of the country on a bus. At every stop, local vendors will get on the bus and sell Tupig and other kakanin as snacks or pasalubongs to the passengers.",
			"image" : "https://i2.wp.com/www.panlasangpinoyrecipes.com/wp-content/uploads/2015/03/Tupig-Recipe.jpg?w=654&ssl=1",
			"ingredients" : [
				"4 pcs mature coconut shredded",
				"1 pc young coconut shredded",
				"1/4 cup toasted sesame seeds",
				"4 cups water",
				"1 kg malagkit flour",
				"banana leaves wilted",
				"3/4 cup molasses"
			],
			"instructions" : [
				"Extract coconut milk from mature coconut by adding water and squeezing out gata or coconut milk.",
				"Strain and set aside.",
				"Add remaining ingredients to coconut milk.",
				"Mix well.",
				"Pour 1/4 cup batter on wilted banana leaves, roll and seal ends.",
				"Bake over live charcoal 15 to 20 minutes or until done."
			],
			"video_link" : ""
		},
		{
			"id" : "00009",
			"title" : "Vigan Longganisa",
			"description" : "Vigan City celebrates its unique and flavorful Filipino longganisa with an annual festival every year. Vigan longganisa, also known as Ilocano longganisa, is a type of Filipino pork sausage originating from Vigan City, Ilocos Sur.",
			"image" : "https://i.ytimg.com/vi/ytobUJZxLbc/maxresdefault.jpg",
			"ingredients" : [
				"1 kilo ground pork pigue or kasim 20% fat, 70% lean meat ratio.",
				"1/4 cup garlic crushed and chopped",
				"1 Tbsp. onions chopped (optional)",
				"1 tsp. salt up to 1 Tbsp.",
				"1 tsp. phosphate accord powder mixed with 1 Tbsp. water (optional)",
				"1 tsp. black pepper ground",
				"1/3 cup soy sauce",
				"2 1/4 Tbsp. vinegar sukang Iloko or cane vinegar",
				"2 yards sausage or hog casing",
				"1/2 cup water",
				"2 Tbsp. cooking oil (optional)"
			],
			"instructions" : [
				"In a bowl, mix thoroughly the first eight ingredients until well blended.",
				"Stuff the mixture into casing and tie every 2 inches long with a string.",
				"Hang under direct sunlight for about 4 hours to allow fat and liquid to drip and dry.",
				"Heat a carajay and pour 1/2 cup water and 1-2 tablespoons cooking oil.",
				"Put in the longanisa. Cover and cook over low heat until all of the water evaporates. Prick each with a fork.",
				"When all liquid has evaporated, pan fry until brown.",
				"Serve hot with fried rice, tomatoes and sliced salted eggs. Serves 8"
			],
			"video_link" : ""
		},
		{
			"id" : "00010",
			"title" : "Poqui-Poqui",
			"description" : "A beloved dish from Ilocos, Poqui-Poqui (also known as poki poki) is a delicious combination of grilled eggplant, onion, and tomatoes scrambled with egg. The eggplant is first cooked over an open flame, peeled, and mashed before being mixed with the other ingredients.",
			"image" : "https://4.bp.blogspot.com/-34IOQyXI0L0/VHeiJ92kmtI/AAAAAAAAAUg/B7Be6uuGQqE/s1600/poqui%2Bpoqui%2B2.JPG",
			"ingredients" : [
				"2 large eggplants",
				"2 tablespoons oil",
				"1 small onion, peeled and sliced thinly",
				"2 cloves garlic",
				"2 large Roma tomatoes, chopped",
				"4 eggs, beaten",
				"salt and pepper to taste"
			],
			"instructions" : [
				"Over hot coals or gas stove, grill eggplants until skins are charred. Remove from heat and under running water, peel skin and rinse well. Coarsely chop flesh.",
				"In a skillet over medium heat, heat oil. Add onions and garlic and cook until softened.",
				"Add tomatoes and continue to cook, mashing with the back of the spoon, until softened.",
				"Add eggplant. Season with salt and pepper to taste.",
				"Add beaten eggs, stirring to combine, and continue to cook until eggs are just set. Serve hot."
			],
			"video_link" : ""
		}
	]
}